In [1]:
import numpy as np
import pandas as pd

In [2]:
list1 = [[9904312,3448737,2890451,2466052],[9631482,3393191,2632035,2431774]]

col = ["서울","부산","인천","대구"]
idx = ["2015","2010"]
df2 = pd.DataFrame(list1, index=idx,columns=col)
df2

           서울       부산       인천       대구
2015  9904312  3448737  2890451  2466052
2010  9631482  3393191  2632035  2431774

In [4]:
df2 = df2.T

In [5]:
df2["2015"]

서울    9904312
부산    3448737
인천    2890451
대구    2466052
Name: 2015, dtype: int64

#### 인덱서
- 인덱서?
    - Pandas 객체에 대해서 "속성, []사용" 으로써, 행과 열을 한번에 인덱싱 하거나 슬라이싱하는 기능
    - 보통은 행 접근을 하기 위한 용도로 사용(열접근도 가능)
- loc[] 인덱서
    - location 약자, <b>인덱스명</b> <b>컬럼명</b>을 가지고 인덱싱/슬라이싱 하는 기능
    - loc.["행이름","열이름"]
    - loc.["행시작이름":"행의 끝이름","열시작이름":"열의 끝 이름]
    - df.loc["행이름"]-> 열은 전체 출력

- iloc[] 인덱서
    - location 약자, <b>인덱스명</b> <b>컬럼명</b>을 가지고 인덱싱/슬라이싱 하는 기능
    - loc.["행번호","열번호"]
    - loc.["행시작번호":"행의 끝번호","열시작번호":"열의끝번호"]
    - df.loc["행번호"]-> 열은 전체 출력

#### score 실습 DataFrame 정렬, 연산
- axis
    - axis = 0 : 위아래 연산, 행들에 대해 접근 피쳐기준
    - axis = 1 : 양 옆 연산, 열들에 대해 접근 인스턴스기준

In [ ]:
df = pd.read_csv("C:\\Users\\SMHRD\\Desktop\\스인재\\강의내용\\data\\score.csv",encoding='euc-kr')

In [114]:
score = df.copy()

In [ ]:
# DataFrame 정렬
# sort_values(by="컬럼명")
score.sort_values(by="3반",ascending=False)

In [ ]:

score.index = ["파이썬","DB","자바","크롤링","Web"]
score = score.drop("과목",axis=1)
score

In [116]:
score.index.name = '과목'

In [121]:
score['합계'] = score.loc[:"Web",:"4반"].sum(axis=1)
score

     1반  2반  3반  4반     합계
과목
파이썬  45  44  73  39  201.0
DB   76  92  45  69  282.0
자바   47  92  45  69  253.0
크롤링  92  81  85  40  298.0
Web  11  79  47  26  163.0

In [136]:
score.loc["반평균"] = score.mean(axis=0)
score

       1반    2반    3반    4반     합계
과목
파이썬  45.0  44.0  73.0  39.0  201.0
DB   76.0  92.0  45.0  69.0  282.0
자바   47.0  92.0  45.0  69.0  253.0
크롤링  92.0  81.0  85.0  40.0  298.0
Web  11.0  79.0  47.0  26.0  163.0
반평균  54.2  77.6  59.0  48.6  239.4

In [137]:
score.astype(np.int64)

     1반  2반  3반  4반   합계
과목
파이썬  45  44  73  39  201
DB   76  92  45  69  282
자바   47  92  45  69  253
크롤링  92  81  85  40  298
Web  11  79  47  26  163
반평균  54  77  59  48  239

In [140]:
#과목별로 최대값과 최소값의 차이
df1 = score.loc[:"Web",:"4반"]

In [145]:
max_sub = df1.max(axis=1)
min_sub = df1.min(axis=1)

#### apply() 함수
- pandas 객체 열 or 행에 대해 함수를 적용하게 해주는 메소드

In [150]:
# max - min 을 구해주는 함수 정의
def max_min(x):
    return x.max() - x.min()

In [152]:
df1.apply(max_min, axis=1)

과목
파이썬    34.0
DB     47.0
자바     47.0
크롤링    52.0
Web    68.0
dtype: float64

In [153]:
data = {"Name":['Jhon','Anna','Peter','Linda'],
        "Email": ["jhon@gmail.com","anna@yahoo.co.kr","peter@gamil.com","linda@outlook.com"]}

df = pd.DataFrame(data)
df

    Name              Email
0   Jhon     jhon@gmail.com
1   Anna   anna@yahoo.co.kr
2  Peter    peter@gamil.com
3  Linda  linda@outlook.com

In [158]:
# 이메일 추출 함수 정의
def extract_domain(x):
    return x.split("@")[1]

In [159]:
df['Email'].apply(extract_domain)

0      gmail.com
1    yahoo.co.kr
2      gamil.com
3    outlook.com
Name: Email, dtype: object

In [157]:
df['Email']

0       jhon@gmail.com
1     anna@yahoo.co.kr
2      peter@gamil.com
3    linda@outlook.com
Name: Email, dtype: object

#### 데이터 병합
- merge()
    - 특정 컬럼을 기준으로 병합
- concat()
    - 축의 방향을 기준으로 병합

In [170]:
data1 = {
    '이름': ['홍길동','이순신','신사임당'],
    '나이': ['23','55','48'],
    '성별':['남','남','여']
}

data2 = {
    '이름': ['홍길동','홍길동','홍길동','신사임당','장보고'],
    '영화': ['터미네이터','비긴어게인','살인의추억','비긴어게인','살인의추억'],
    '평점':['5','2','4','5','3']
}

In [171]:
h_info = pd.DataFrame(data1)
r_info = pd.DataFrame(data2)

In [172]:
h_info

     이름  나이 성별
0   홍길동  23  남
1   이순신  55  남
2  신사임당  48  여

In [173]:
r_info

     이름     영화 평점
0   홍길동  터미네이터  5
1   홍길동  비긴어게인  2
2   홍길동  살인의추억  4
3  신사임당  비긴어게인  5
4   장보고  살인의추억  3

In [177]:
# merge(left, right, on ="기준이될 컬럼명",)
pd.merge(h_info,r_info, on="이름", how="left")

     이름  나이 성별     영화   평점
0   홍길동  23  남  터미네이터    5
1   홍길동  23  남  비긴어게인    2
2   홍길동  23  남  살인의추억    4
3   이순신  55  남    NaN  NaN
4  신사임당  48  여  비긴어게인    5

In [180]:
# concat의 axis는 기본값이 0으로 인스턴스 기준
pd.concat([h_info,r_info],axis=0)

     이름   나이   성별     영화   평점
0   홍길동   23    남    NaN  NaN
1   이순신   55    남    NaN  NaN
2  신사임당   48    여    NaN  NaN
0   홍길동  NaN  NaN  터미네이터    5
1   홍길동  NaN  NaN  비긴어게인    2
2   홍길동  NaN  NaN  살인의추억    4
3  신사임당  NaN  NaN  비긴어게인    5
4   장보고  NaN  NaN  살인의추억    3

In [175]:
l = 5
r = 555

answer = []
special_numbers = []
for num in range(l, r + 1):
    num_str = str(num)
    if all(digit in ['0', '5'] for digit in num_str):
        special_numbers.append(num)
special_numbers
print(special_numbers)

[5, 50, 55, 500, 505, 550, 555]